Revit 2027 API
StairsLandingType.Thickness Property
 Thickness of the stairs landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Thickness { get; set; }
Public Property Thickness As Double
	Get
	Set
public:
property double Thickness {
	double get ();
	void set (double value);
}
member Thickness : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for thickness must be greater than 0 and no more than 30000 feet.
InvalidOperationException |  When setting this property: The landing type doesn't have monolithic support.
See Also
Reference
StairsLandingType Class
Autodesk.Revit.DB.Architecture Namespace